<?php require_once("func.php");?>
<!doctype html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>
<pre>Веб-разработчик/Web-программист в Волгограде (горит)
В Интернет-агентство ИНТЕРВОЛГА требуется веб-программист на полный рабочий день (в офис).

ИНТЕРВОЛГА занимается разработкой технологически сложных сайтов, интернет-магазинов, онлайн-бирж.

Среди клиентов Альфа-Банк, Дискуссионный клуб Валдай, дистрибьюторы концерна Shell и многие другие крупные компании.

Веб-программист у нас — ключевой человек, наносящий основное добро в проекте. Ему предстоит четко реализовать все, что придумали до него менеджеры и дизайнеры. Программист окружен интересными задачами, уважением коллег и ореолом героя.

Вам будет интересно в нашем коллективе. У нас 18 штатных программистов и еще человек 5 делают это втайне от других, так как работают менеджерами.

Требуемый опыт работы: 1–3 года
Полная занятость, гибкий график
Обязанности:

Серверная и клиентская веб-разработка.
Интересные проекты для крупных компаний. Потребуется применение современных средств командной разработки, систем контроля версий.
Работа в профессиональном коллективе, растущие задачи, развитие.
Требования:

Опыт разработки проектов, высокая программистская квалификация, знание php, понимание основ баз данных, понимание особенностей веба.
На собеседовании расскажете о своем опыте, мы проверим знания, обсудим будущее.
Хорошего программиста (например, из мира C#, 1C или Java) готовы принять без опыта в вебе.
мы проверяем по матрице компетенций https://www.intervolga.ru/blog/life/web-developer-competence-matrix/, изучите ее
ждем уровня не ниже first middle
Условия:

Стабильная растущая зарплата, хороший коллектив, обучение и корпоративные развлечения.
Из офиса вид на Волгу.
Заработная плата от 46 000 до 51 000 руб. до вычета НДФЛ
Ждем резюме

Приложите к резюме ответы на вопросы:

1. Простая интеграция

Сделать веб-страничку запроса курса USD. На странице — форма. В форме поле даты и кнопка "запросить"

После отправки формы скрипт ищет курс на эту дату в локальной БД. Если его нет — идёт в API ЦБ РФ https://www.cbr.ru/development/SXML/ и вытаскивает курс доллара. Потом сохраняет в локальную БД и выводит пользователю.

Пришлите ссылку на репозиторий с решением

2. Кодинг

Вывести массив змейкой на php. Размеры массива M*N.



3. SQL

Есть регионы, в них города, в них аптеки.
Есть таблица товаров, находящихся в аптеках.
Есть таблица “черный список”. В ней указано, какие товары запрещено ввозить в определенные города.
Вывести список с колонками: регион, город, аптека, количество уникальных товаров в аптеке.
При подсчете количества товаров не должна учитываться "запрещенка".
Структуру таблиц придумать самостоятельно.
Ожидаемый результат: структура БД и запросы на SQL.


Прочитайте статью: https://www.intervolga.ru/blog/life/kak-my-nakhodim-uchim-i-razvivaem-programmistov/

Ученик PHP-разработчика / web-программист-стажер (горит)
Интернет-агентство «ИНТЕРВОЛГА» — крупнейшая веб-компания в Волгограде и ЮФО. Мы занимаемся разработкой сложных сайтов, порталов, систем автоматизации и комплексным интернет-маркетингом. Мы предлагаем сотрудникам хорошо организованный процесс работы в проектных командах, адекватную ЗП, переаттестацию 1-2 раза в год.

В компании работает около 60 человек. Офис в центре города с видом на Волгу.

ИНТЕРВОЛГА выращивает профессиональных веб-разработчиков из студентов или начинающих специалистов.

Мы проводим обучение по современным средствам разработки, предоставляем рабочее место и необходимое программное обеспечение, доступ к знаниям опытных разработчиков.

С первого дня вы будете получать стажерскую зарплату (25 тысяч рублей в месяц при отработке полный рабочий день, 15.5 тысяч рублей в месяц за 5 часов в офисе в день). 

Первые 2 недели вы будете решать почти только учебные задачи, потом все больше задач настоящих.

Вы познакомитесь с современными средствами разработки веб-систем: PHPStorm, Git, веб-серверами и отладочной консолью.

Через месяц вы будете решать первые настоящие задачи для крупных заказчиков, работать с крутыми технологиями и совершенными инструментами.

Обязанности после прохождения стажировки:

Разработка современных производительных нагруженных сайтов, порталов, систем автоматизации
Работа в проектных командах (менеджер проекта, ведущий разработчик, дизайнер, фронтенд, бекенд)
разработка на Bitrix Framwork для Битрикс24 и Битрикс: управление сайтом
Требования:

Берем на прохождение практики начинающих специалистов и студентов последних курсов
Интерес к разработке проектов, знания основ программирования (написали больше 5000 строк кода в своей жизни, базовое знание php, понимание основ баз данных, понимание особенностей веба).
Условия:

Дружелюбные руководители и менеджеры проектов.
Профессиональные коллеги -- рядом всегда будет у кого спросить
Возможность освоения профессии веб-разработчика, знакомство со смежными специальностями: управление проектами, интернет-маркетинг, веб-аналитика, UI/UX
Возможность гибкого графика, всегда можно на несколько часов уйти по делам
Отсутствие дурной бюрократии, деловая атмосфера
Интересные веб-проекты для "живых" компаний.
Научим применению современных средств командной разработки, систем контроля версий, миграции данных.
План роста квалификации и освоения новых технологий для каждого сотрудника, оплаченные сертификационные экзамены и время на обучение
Офис в ИКРЕ, речпорт</pre>
<body>

</body>

</html>